Tekla.Structures.DrawingInternal.DrawingHandler
The DrawingHandler class initializes the interface from a .NET application to Tekla Structures. This object
must be created before any actions can be performed on Tekla Structures drawings.
When this object is created, it is possible to ask the current active
drawing in Tekla Structures, get a list of drawings or create a new drawing.

Tekla.Structures.DrawingInternal.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.DPMPrinterAttributes)
Prints the drawing using the given printer attributes.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Returns: True on success, false if printing fails.

Tekla.Structures.DrawingInternal.DrawingHandler.PrintDrawing(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Drawing.DPMPrinterAttributes,System.String)
Prints the drawing to file using the given printer attributes and name of the output file.
The given output file overrides the printer attributes file settings.
drawing: The drawing to be printed.
printAttributes: The print attributes for the print job.
outputFile: The print output file name.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Returns: True on success, false if printing fails.

Tekla.Structures.DrawingInternal.DrawingHandler.PrintDrawings(System.Collections.Generic.List{Tekla.Structures.Drawing.Drawing},Tekla.Structures.Drawing.DPMPrinterAttributes)
Prints the list of drawings using the given printer attributes.
drawings: The list of drawings to be printed.
printAttributes: The print attributes for the print job.
Throws System.ArgumentException: Thrown if PDF printing selected, but no file name provided.
Returns: True on success, false if printing fails.